Repository: iveshzf/TUIKit_Flutter
Catalog: atomic-x/lib/*_component/l10n/l10n_*.arb
Languages: ar, ja, ko, zh, zh_hant

source: Quote
ar: اقتباس
ja: 引用
ko: 인용
zh: 引用
zh_hant: 引用

source: Reply
ar: الرد
ja: 返信
ko: 답장
zh: 回复
zh_hant: 回覆

# searchUserID
source: Please enter User ID to search for users
ar: يرجى إدخال معرف المستخدم للبحث عن المستخدمين
ja: ユーザーIDを入力してユーザーを検索してください
ko: 사용자 ID를 입력하여 사용자를 검색하세요
zh: 请输入 User ID 搜索用户
zh_hant: 請輸入用戶 ID 搜尋用戶

source: Search Group ID
ar: البحث عن معرف المجموعة
ja: グループIDを検索
ko: 그룹 ID 검색
zh: 搜索群 ID
zh_hant: 搜尋群組 ID

# searchGroupIDHint
source: Please enter Group ID to search for groups
ar: يرجى إدخال معرف المجموعة للبحث عن المجموعات
ja: グループIDを入力してグループを検索してください
ko: 그룹 ID를 입력하여 그룹을 검색하세요
zh: 请输入群 ID 搜索群聊
zh_hant: 請輸入群組 ID 搜尋群聊

source: Add failed
ar: إضافة فاشلة
ja: 友達の追加に失敗しました
ko: 친구 추가 실패
zh: 添加失败
zh_hant: 添加失敗

source: Join group failed
ar: فشل في الانضمام إلى المجموعة
ja: グループへの参加に失敗しました
ko: 그룹 참가 실패
zh: 加入失败
zh_hant: 加入失敗

source: Already in group
ar: أنت بالفعل في المجموعة
ja: すでにグループに参加しています
ko: 이미 그룹에 있습니다
zh: 已在群中
zh_hant: 已在群中

# alreadyFriend
source: Already friends
ar: أصدقاء بالفعل
ja: すでに友達
ko: 이미 친구
zh: 已经是好友
zh_hant: 已經是好友

# signature
source: Bio
ar: التوقيع
ja: 自己紹介
ko: 자기소개
zh: 个性签名
zh_hant: 個性簽名

source: Search error
ar: خطأ في البحث
ja: 検索エラー
ko: 검색 오류
zh: 搜索异常
zh_hant: 搜尋異常

# fillInTheVerificationInformation
source: Fill in verification information
ar: إملأ معلومات التحقق
ja: 確認情報を入力してください
ko: 인증정보를 입력하세요
zh: 填写验证信息
zh_hant: 填寫驗證資訊

# joinedGroupSuccessfully
source: success
ar: نجاح
ja: 成功
ko: 성공
zh: 成功
zh_hant: 成功

source: Contact Added Successfully
ar: تمت إضافة جهة الاتصال بنجاح
ja: 連絡先が正常に追加されました
ko: 연락처가 성공적으로 추가되었습니다
zh: 联系人添加成功
zh_hant: 成功加聯絡人

source: Message
ar: الرسائل
ja: メッセージ
ko: 정보
zh: 消息
zh_hant: 訊息

# groupWork
source: Work
ar: مجموعة العمل
ja: 作業グループ
ko: 작업 그룹
zh: 工作群
zh_hant: 工作群

# groupPublic
source: Public
ar: مجموعة عامة
ja: 公開グループ
ko: 공개 그룹
zh: 公开群
zh_hant: 公開群

# groupMeeting
source: Meeting
ar: مجموعة الاجتماعات
ja: ミーティンググループ
ko: 회의 그룹
zh: 会议群
zh_hant: 會議群

# groupCommunity
source: Community
ar: مجتمع
ja: コミュニティ
ko: 지역 사회
zh: 社群
zh_hant: 社群

# groupAVChatRoom
source: AVChatRoom
ar: مجموعة البث المباشر
ja: ライブ放送グループ
ko: 생방송 그룹
zh: 直播群
zh_hant: 直播群

# groupAddAny
source: Auto Approval
ar: موافقة تلقائية
ja: 自動承認
ko: 자동 승인
zh: 自动审批
zh_hant: 自動審批

# groupAddAuth
source: Admin Approval
ar: موافقة المدير
ja: 管理者の承認
ko: 관리자 승인
zh: 管理员审批
zh_hant: 管理員審批

# groupAddForbid
source: Prohibited from Joining
ar: منع الانضمام
ja: グループへの参加は禁止です
ko: 그룹 가입이 금지되어 있습니다.
zh: 禁止加群
zh_hant: 禁止加群

# groupInviteForbid
source: Prohibited from Inviting
ar: منع الدعوة
ja: 招待なし
ko: 초대장 없음
zh: 禁止邀请
zh_hant: 禁止邀請

# groupOwner
source: Owner
ar: مالك المجموعة
ja: グループのオーナー
ko: 그룹 소유자
zh: 群主
zh_hant: 群主

source: Member
ar: عضو
ja: メンバー
ko: 회원
zh: 成员
zh_hant: 成員

source: Admin
ar: مشرف
ja: 管理者
ko: 관리자
zh: 管理员
zh_hant: 管理員

# modifyGroupName
source: Edit Group Name
ar: تعديل اسم المجموع
ja: グループ名を変更する
ko: 그룹 이름 수정
zh: 修改群名称
zh_hant: 修改群名稱

# groupNickname
source: My Alias in Group
ar: اسم المستعار في المجموعة
ja: 私のグループのニックネーム
ko: 내 그룹 별명
zh: 我的群昵称
zh_hant: 我的群昵稱

# modifyGroupNickname
source: Edit My Alias in Group
ar: تعديل اسمي الداخلي في المجموعة
ja: グループのニックネームを変更する
ko: 내 그룹 닉네임 변경
zh: 修改我的群昵称
zh_hant: 修改我的群昵稱

# modifyGroupNoticeSuccess
source: Edited
ar: تم تعديل إعلان المجموعة بنجاح
ja: グループのお知らせを変更しました
ko: 그룹 공지사항 수정이 성공적으로 완료되었습니다.
zh: 修改群公告成功
zh_hant: 修改群公告成功

# quitGroupTip
source: Leave the group?
ar: هل تريد بالتأكيد الخروج من هذه المجموعة؟
ja: このグループを脱退してもよろしいですか?
ko: 정말로 이 그룹을 떠나시겠습니까?
zh: 您确认退出该群？
zh_hant: 您確認退出該群？

# dismissGroupTip
source: Disband the group?
ar: هل تريد بالتأكيد حل هذه المجموعة؟
ja: このグループを解散してもよろしいですか?
ko: 이 그룹을 해체하시겠습니까?
zh: 您确认解散该群？
zh_hant: 您確認解散該群？

# clearMsgTip
source: Are you sure you want to clear the chat history?
ar: هل تريد بالتأكيد مسح سجل الدردشة؟
ja: チャット履歴を消去しますか?
ko: 채팅 기록을 지우시겠습니까?
zh: 确认清除聊天记录？
zh_hant: 確認清除聊天記錄？

source: Mute All
ar: كتم الجميع
ja: 全員がミュートされている
ko: 모두 음소거 상태입니다
zh: 全员禁言
zh_hant: 全員禁言

# addMuteMemberTip
source: Add members to mute
ar: إضافة أعضاء المجموعة الذين يجب كتمهم
ja: ミュートするグループメンバーを追加する
ko: 음소거할 그룹 구성원 추가
zh: 添加需要禁言的群成员
zh_hant: 添加需要禁言的群成員

# groupMuteTip
source: When Mute All is enabled, only the group owner and admins are allowed to send messages.
ar: بعد تفعيل كتم الجميع، سيتم السماح فقط للمدير والمشرفين بالتحدث.
ja: ミュート機能を有効にすると、グループの所有者と管理者のみが発言できるようになります。
ko: 음소거 기능이 활성화되면 그룹 소유자와 관리자만 말할 수 있습니다.
zh: 全员禁言开启后，只允许群主和管理员发言。
zh_hant: 全員禁言開啟後，只允許群主和管理員發言。

# deleteFriendTip
source: Are you sure you want to delete the contact?
ar: هل تريد بالتأكيد حذف جهة الاتصال؟
ja: 連絡先を削除しますか?
ko: 연락처 삭제를 확인하시겠습니까?
zh: 确认删除联系人？
zh_hant: 確認刪除聯繫人？

# remarkEdit
source: Edit Alias
ar: تعديل الملاحظات
ja: 変更点
ko: 수정 사항
zh: 修改备注
zh_hant: 修改備註

# detail
source: Details
ar: تفاصيل
ja: 詳細
ko: 세부
zh: 详情
zh_hant: 詳情

# setAdmin
source: Set Administrator
ar: تعيين كمدير
ja: 管理者として設定
ko: 관리자로 설정
zh: 设置为管理员
zh_hant: 設置為管理員

source: Cancel Admin
ar: إلغاء تعيين المدير
ja: キャンセル管理者
ko: 관리자 취소
zh: 取消管理员
zh_hant: 取消管理員

# deleteGroupMemberTip
source: Confirm to delete group member?
ar: تأكيد حذف عضو المجموعة؟
ja: グループメンバーを削除しますか?
ko: 그룹 구성원을 삭제하시겠습니까?
zh: 确认删除群成员？
zh_hant: 確認刪除群組成員？

# settingSuccess
source: Setup Success!
ar: تم الإعداد بنجاح!
ja: セットアップに成功しました!
ko: 설치가 성공했습니다!
zh: 设置成功！
zh_hant: 設置成功！

# settingFail
source: Setup failed!
ar: فشل الإعداد!
ja: セットアップに失敗しました!
ko: 설치에 실패했습니다!
zh: 设置失败！
zh_hant: 設置失敗！

source: No more
ar: لا مزيد
ja: もうない
ko: 더 이상은 없다
zh: 没有更多了
zh_hant: 沒有更多了

# sayTimeShort
source: Message too short
ar: مدة الكلام قصيرة جدًا
ja: 話す時間が短すぎる
ko: 말하는 시간이 너무 짧습니다
zh: 说话时间太短
zh_hant: 說話時間太短

# recordLimitTips
source: Maximum voice length reached
ar: تم الوصول إلى الحد الأقصى لطول الصوت
ja: スピーチの最大長に達しました
ko: 최대 음성 길이에 도달했습니다.
zh: 已达到最大语音长度
zh_hant: 已達到最大語音長度

source: ON
ar: يفتح
ja: 開ける
ko: 열려 있는
zh: 开
zh_hant: 開

source: OFF
ar: يغلق
ja: 近い
ko: 닫다
zh: 关
zh_hant: 關

source: Choose Avatar
ar: اختر صورة رمزية
ja: アバターを選択
ko: 아바타를 선택하세요
zh: 选择头像
zh_hant: 選擇頭像

# inputGroupName
source: Please enter a group name
ar: الرجاء إدخال اسم المجموعة
ja: グループ名を入力してください
ko: 그룹 이름을 입력하세요
zh: 请输入群名称
zh_hant: 請輸入群組名稱

source: Error
ar: خطأ
ja: 間違い
ko: 실수
zh: 错误
zh_hant: 錯誤

# permissionNeeded
source: Required permissions
ar: الأذونات المطلوبة
ja: 必要な権限
ko: 필수 권한
zh: 需要权限
zh_hant: 需要權限

# permissionDeniedContent
source: Please go to Settings and enable the Photos permission.
ar: يرجى الذهاب إلى الإعدادات وتفعيل أذونات الصور.
ja: 「設定」に移動して写真の権限を有効にしてください。
ko: 설정으로 가서 사진 권한을 허용해 주세요.
zh: 请前往设置并启用相册权限。
zh_hant: 請前往設定並啟用相簿權限。

# maxCountFile
source: You can only select at most {maxCount} files
ar: يمكنك تحديد {maxCount} ملف كحد أقصى فقط
ja: 選択できるファイルは最大 {maxCount} 個までです
ko: 최대 {maxCount}개의 파일만 선택할 수 있습니다.
zh: 最多只能选择 {maxCount} 个文件
zh_hant: 最多只能選擇 {maxCount} 個文件

# groupIntroDeleted
source: deleted group description
ar: تم حذف ملف تعريف المجموعة
ja: グループプロフィールを削除しました
ko: 삭제된 그룹 프로필
zh: 删除了群简介
zh_hant: 刪除了群簡介

# groupJoinForbidden
source: Join forbidden
ar: الانضمام محظور
ja: 参加禁止
ko: 참여 금지
zh: 禁止加群
zh_hant: 禁止加群

# groupJoinApproval
source: Admin approval required
ar: يتطلب موافقة المشرف
ja: 管理者承認が必要
ko: 관리자 승인 필요
zh: 管理员审批
zh_hant: 管理員審批

# groupJoinFree
source: Free to join
ar: انضمام حر
ja: 自由参加
ko: 자유 참여
zh: 自由加群
zh_hant: 自由加群

# groupInviteForbidden
source: Invite forbidden
ar: الدعوة محظورة
ja: 招待禁止
ko: 초대 금지
zh: 禁止邀请
zh_hant: 禁止邀請

# groupInviteApproval
source: Admin approval required
ar: يتطلب موافقة المشرف
ja: 管理者承認が必要
ko: 관리자 승인 필요
zh: 管理员审批
zh_hant: 管理員審批

# groupInviteFree
source: Free to invite
ar: دعوة حرة
ja: 自由招待
ko: 자유 초대
zh: 自由邀请
zh_hant: 自由邀請

# mergeMessage
source: Merge Messages
ar: دمج الرسائل
ja: メッセージを結合する
ko: 메시지 병합
zh: 合并消息
zh_hant: 合併消息

# upgradeLatestVersion
source: Please upgrade to the latest version
ar: الرجاء الترقية إلى أحدث إصدار
ja: 最新バージョンにアップグレードしてください
ko: 최신 버전으로 업그레이드해주세요
zh: 请升级最新版本
zh_hant: 請升級最新版本

# friendLimit
source: The number of your contacts exceeds the limit.
ar: لقد وصلت إلى الحد الأقصى لعدد الأصدقاء في النظام
ja: 友達の数がシステムの制限に達しました
ko: 귀하의 친구 수가 시스템 한도에 도달했습니다.
zh: 您的好友数已达系统上限
zh_hant: 您的好友數已達系統上限

# otherFriendLimit
source: The number of the other user's contacts exceeds the limit.
ar: لقد وصل الشخص المطلوب إلى الحد الأقصى لعدد الأصدقاء في النظام
ja: 相手の友達数がシステムの上限に達しています
ko: 상대방의 친구 수가 시스템 한도에 도달했습니다.
zh: 对方的好友数已达系统上限
zh_hant: 對方的好友數已達系統上限

# inBlacklist
source: You have blocked this user.
ar: الشخص المطلوب موجود في القائمة السوداء الخاصة بك
ja: ブラックリストに友達として追加される
ko: 블랙리스트에 친구로 추가됨
zh: 被加好友在自己的黑名单中
zh_hant: 被加好友在自己的黑名單中

# setInBlacklist
source: You have been blocked.
ar: لقد تم إضافتك إلى القائمة السوداء من قبل الشخص المطلوب
ja: 相手からブラックリストに登録されている
ko: 상대방에 의해 블랙리스트에 등록되었습니다.
zh: 您已被被对方设置为黑名单
zh_hant: 您已被被對方設置為黑名單

# forbidAddFriend
source: This user has disabled contact request.
ar: الشخص المطلوب قد منع إضافة الأصدقاء
ja: 相手が友達追加を禁止されている
ko: 상대방이 친구를 추가할 수 없도록 차단되었습니다.
zh: 对方已禁止加好友
zh_hant: 對方已禁止加好友

# waitAgreeFriend
source: Request sent
ar: في انتظار موافقة الصديق
ja: 友達からのレビューと承認を待っています
ko: 친구들의 검토와 승인을 기다리는 중
zh: 等待好友审核同意
zh_hant: 等待好友審核同意

# haveBeFriend
source: You two are already contacts of each other.
ar: الشخص المطلوب هو بالفعل صديقك
ja: 相手はすでにあなたの友達です
ko: 그 사람은 이미 당신의 친구입니다.
zh: 对方已是您的好友
zh_hant: 對方已是您的好友

# addGroupPermissionDeny
source: Prohibited from Joining
ar: منع الانضمام
ja: グループへの参加は禁止です
ko: 그룹 가입이 금지되어 있습니다.
zh: 禁止加群
zh_hant: 禁止加群

# addGroupAlreadyMember
source: The user is a group member
ar: أنت بالفعل عضو في المجموعة
ja: すでにグループメンバーです
ko: 이미 그룹 회원입니다.
zh: 已经是群成员
zh_hant: 已經是群成員

# addGroupNotFound
source: The group does not exist
ar: المجموعة غير موجودة
ja: グループが存在しません
ko: 그룹이 존재하지 않습니다
zh: 群组不存在
zh_hant: 群組不存在

# addGroupFullMember
source: The number of group members has reached the limit
ar: المجموعة ممتلئة بالأعضاء
ja: グループは満員です
ko: 그룹이 가득 찼습니다.
zh: 群已满员
zh_hant: 群已滿員

# chatRecords
source: {count} related records
ar: {count} سجل ذو صلة
ja: {count} 件の関連レコード录
ko: {count} 관련 레코드
zh: {count}条相关记录
zh_hant: {count}條相關記錄

# addRule
source: Contact Request
ar: عندما يضيفني شخص ما كصديق
ja: お問い合わせリクエスト
ko: 연락 요청
zh: 加我为好友时
zh_hant: 加我為好友時

# allowAny
source: Allow anyone
ar: السماح لأي شخص
ja: 誰でも許可
ko: 누구나 허용
zh: 允许任何人
zh_hant: 允許任何人

# denyAny
source: Deny anyone
ar: رفض أي شخص
ja: 誰でも拒否
ko: 누구나 거부
zh: 拒绝任何人
zh_hant: 拒絕任何人

# needConfirm
source: Requires verification
ar: يتطلب التحقق
ja: 確認が必要
ko: 확인 필요
zh: 需要验证
zh_hant: 需要驗證

# noSignature
source: No signature yet
ar: لا يوجد توقيع شخصي بعد
ja: まだ署名なし
ko: 아직 서명 없음
zh: 暂无个性签名
zh_hant: 暫無個性簽名

source: Gender
ar: الجنس
ja: 性別
ko: 성별
zh: 性别
zh_hant: 性別

source: Male
ar: ذكر
ja: 男性
ko: 남성
zh: 男
zh_hant: 男

source: Female
ar: أنثى
ja: 女性
ko: 여성
zh: 女
zh_hant: 女

source: Birthday
ar: عيد الميلاد
ja: 誕生日
ko: 생일
zh: 生日
zh_hant: 生日

# setNickname
source: Edit nickname
ar: تعديل الاسم المستعار
ja: ニックネームを編集
ko: 닉네임 수정
zh: 修改昵称
zh_hant: 修改暱稱

# setSignature
source: Edit signature
ar: تعديل التوقيع الشخصي
ja: 署名を編集
ko: 서명 수정
zh: 修改个性签名
zh_hant: 修改個性簽名

# messageNum
source: messages
ar: رسالة
ja: 件
ko: 조각
zh: 条
zh_hant: 條

source: [Draft]
ar: [مسودة]
ja: [下書き]
ko: [임시저장]
zh: [草稿]
zh_hant: [草稿]

# sendMessageFail
source: Send Failed
ar: فشل الإرسال
ja: 送信に失敗しました
ko: 보내기 실패
zh: 发送失败
zh_hant: 發送失敗

# resendTips
source: Are you sure you want to resend?
ar: هل تريد إعادة الإرسال؟
ja: 再送信してもよろしいですか?
ko: 다시 보내시겠습니까?
zh: 确定重发吗？
zh_hant: 確定重發嗎？

# callRejectCaller
source: Call declined by user
ar: تم رفضه من الطرف الآخ
ja: 相手が拒否しました
ko: 상대방이 거부함
zh: 对方已拒绝
zh_hant: 對方已拒絕

# callRejectCallee
source: Declined
ar: تم الرفض
ja: 拒否されました
ko: 거부됨
zh: 已拒绝
zh_hant: 已拒絕

# callCancelCaller
source: Canceled
ar: تم الإلغاء
ja: キャンセル
ko: 취소
zh: 已取消
zh_hant: 已取消

# callCancelCallee
source: Call canceled by caller
ar: تم الإلغاء من الطرف الآخر
ja: 相手がキャンセルした
ko: 상대방이 취소했습니다.
zh: 对方已取消
zh_hant: 對方已取消

# stopCallTip
source: Duration
ar: مدة المكالمة
ja: 通話時間
ko: 통화 시간
zh: 通话时长
zh_hant: 通話時長

# callTimeoutCaller
source: Call was not answered
ar: لا يوجد رد من الطرف الآخر
ja: 相手からの応答がありません
ko: 상대방의 응답이 없습니다.
zh: 对方无应答
zh_hant: 對方無應答

# callTimeoutCallee
source: Call timeout
ar: انتهاء الاتصال بالوقت المحدد
ja: 応答なしでタイムアウトする
ko: 응답 없이 시간 초과.
zh: 超时无应答
zh_hant: 超時無應答

# callLineBusyCaller
source: Line busy
ar: الخط مشغول عند الطرف الآخر
ja: 相手は忙しいです
ko: 상대방이 바빠요
zh: 对方忙线中
zh_hant: 對方忙線中

# callLineBusyCallee
source: Line busy
ar: الخط مشغول عند الطرف الآخر
ja: 話し中のため応答なし
ko: 통화중 회선에 응답이 없습니다.
zh: 忙线未接听
zh_hant: 忙線未接聽

source: Start Call
ar: بدء مكالمة
ja: 通話を開始する
ko: 통화 시작
zh: 发起通话
zh_hant: 發起通話

# acceptCall
source: Answered
ar: تم الرد
ja: 答えた
ko: 답변됨
zh: 已接听
zh_hant: 已接聽

# callingSwitchToAudio
source: Switch to voice call
ar: تحويل الفيديو إلى صوتي
ja: ビデオから音声へ
ko: 영상에서 연설로
zh: 视频转语音
zh_hant: 視頻轉語音

# callingSwitchToAudioAccept
source: Confirm video to voice
ar: تأكيد تحويل الفيديو إلى صوتي
ja: ビデオから音声への変換を確認する
ko: 음성으로 영상 확인
zh: 确认视频转语音
zh_hant: 確認視頻轉語音

source: invalid command
ar: أمر المكالمة غير معروف
ja: 認識できない呼び出しコマンド
ko: 인식할 수 없는 호출 명령
zh: 不能识别的通话指令
zh_hant: 不能識別的通話指令

# groupCallSend
source: initiated a group call
ar: تم بدء مكالمة جماعية
ja: グループ通話が始まりました
ko: 그룹통화가 시작되었습니다
zh: 发起了群通话
zh_hant: 發起了群通話

# groupCallEnd
source: End group call
ar: تم إنهاء المكالمة
ja: 通話が終了しました
ko: 통화가 종료되었습니다
zh: 通话结束
zh_hant: 通話結束

# groupCallNoAnswer
source: no answer
ar: لم يتم الرد
ja: 答えはありません
ko: 답변 없음
zh: 未接听
zh_hant: 未接聽

# groupCallReject
source: declined call
ar: رفض مكالمة جماعية
ja: グループ通話を拒否する
ko: 그룹 통화 거부
zh: 拒绝群通话
zh_hant: 拒絕群通話

# groupCallAccept
source: answered
ar: قبل المكالمة
ja: 答え
ko: 답변
zh: 接听
zh_hant: 接聽

# groupCallConfirmSwitchToAudio
source: confirm to audio call
ar: تأكيد تحويل الفيديو إلى صوتي
ja: 動画を音声に変換することに同意する
ko: 영상을 음성으로 변환하는 데 동의합니다.
zh: 同意视频转语音
zh_hant: 同意視頻轉語音

source: Unknown call
ar: مكالمة غير معروفة
ja: 不明な電話
ko: 알 수 없는 전화
zh: 未知通话
zh_hant: 未知通話

# join
source: join in
ar: انضم إلينا
ja: 参加する
ko: 참여하다
zh: 加入
zh_hant: 加入

# peopleOnCall
source: {number} person are currently on the call
ar: {number} في مكالمة حاليًا.
ja: {number}は現在通話中です。
ko: {number}님은 현재 통화 중입니다.
zh: {number} 人正在通话中
zh_hant: {number}人正在通話中

# messageReadDetail
source: Message Read Details
ar: تفاصيل قراءة الرسالة
ja: 既読詳細
ko: 메시지 읽음 상세
zh: 消息已读详情
zh_hant: 訊息已讀詳情

# groupReadBy
source: Read by
ar: قرأ بواسطة
ja: 既読
ko: 읽음
zh: 已读
zh_hant: 已讀

# groupDeliveredTo
source: Delivered to
ar: تم التسليم إلى
ja: 未読
ko: 읽지 않음
zh: 未读
zh_hant: 未讀

# loadingMore
source: Load more...
ar: تحميل المزيد...
ja: もっと読み込む...
ko: 더 불러오기...
zh: 加载更多...
zh_hant: 載入更多...

source: Unknown file
ar: ملف غير معروف
ja: 不明なファイル
ko: 알 수 없는 파일
zh: 未知文件
zh_hant: 未知檔案

source: Message Read Receipt
ar: حالة قراءة الرسالة
ja: メッセージ既読状態
ko: 메시지 읽음 상태
zh: 消息阅读状态
zh_hant: 消息閱讀狀態

# messageReadReceiptEnabledDesc
source: If disabled, the message read status is hidden for all your messages and for all the messages sent by members in a chat.
ar: عند الإغلاق، لن تظهر حالة قراءة الرسائل في الرسائل التي تستلمها أو ترسلها، ولن تتمكن من معرفة ما إذا قرأ الطرف الآخر الرسالة أم لا، وبالمثل، الطرف الآخر لن يتمكن من معرفة ما إذا قرأت الرسالة أم لا.
ja: オフにすると、送受信するメッセージにはメッセージ既読状態が表示されなくなり、相手がメッセージを読んだかどうかを確認できなくなります。同様に、相手もあなたがメッセージを読んだかどうかを確認できなくなります。
ko: 끄면 보내고 받는 메시지에 메시지 읽음 상태가 표시되지 않으며, 상대방이 메시지를 읽었는지 확인할 수 없고 상대방도 당신이 메시지를 읽었는지 확인할 수 없습니다.
zh: 关闭后，您收发的消息均不带消息阅读状态，您将无法看到对方是否已读，同时对方也无法看到您是否已读。
zh_hant: 關閉後，您收發的消息均不帶消息閱讀狀態，您將無法看到對方是否已讀，同時對方也無法看到您是否已讀。

# messageReadReceiptDisabledDesc
source: If enabled, the message read status is displayed for all your messages and for all the messages sent by members in a chat.
ar: عند الفتح، ستظهر حالة قراءة الرسائل في الرسائل التي تستلمها أو ترسلها في المحادثات الجماعية، ويمكنك رؤية ما إذا قرأ الطرف الآخر الرسالة أم لا. إذا قام أصدقاؤك في المحادثات الفردية بتفعيل حالة قراءة الرسائل، ستظهر حالة قراءة الرسائل في المحادثات الفردية التي تتبادلها معهم.
ja: オンにすると、グループチャットで送受信するメッセージにはメッセージ既読状態が表示され、相手がメッセージを読んだかどうかを確認できます。個人チャットの友人もメッセージ既読状態をオンにしている場合、その友人との個人チャットで送受信するメッセージにもメッセージ既読状態が表示されます。
ko: 켜면 그룹 채팅에서 보내고 받는 메시지에 메시지 읽음 상태가 표시되며, 상대방이 메시지를 읽었는지 확인할 수 있습니다. 개인 채팅 친구도 메시지 읽음 상태를 켜면, 해당 친구와의 개인 채팅에서 보내고 받는 메시지에도 메시지 읽음 상태가 표시됩니다.
zh: 开启后，您在群聊中收发的消息均带有消息阅读状态，并且可以看到对方是否已读。与您单聊的好友若也开启了消息阅读状态，您与好友在单聊中收发的消息也将带有消息阅读状态。
zh_hant: 開啟後，您在群聊中收發的消息均帶有消息閱讀狀態，並且可以看到對方是否已讀。與您單聊的好友若也開啟了消息閱讀狀態，您與好友在單聊中收發的消息也將帶有消息閱讀狀態。

source: Appearance
ar: مظهر
ja: 外観
ko: 외관
zh: 外观
zh_hant: 外觀

source: Mark As Read
ar: وضع علامة كمقروء
ja: 既読にする
ko: 읽음으로 표시
zh: 标为已读
zh_hant: 標為已讀

source: Mark As Unread
ar: وضع علامة كغير مقروء
ja: 未読にする
ko: 읽지 않음으로 표시
zh: 标为未读
zh_hant: 標為未讀

source: Multi-Select
ar: تحديد متعدد
ja: 複数選択
ko: 다중 선택
zh: 多选
zh_hant: 多選

source: Select Chat
ar: اختر محادثة
ja: チャットを選択
ko: 채팅 선택
zh: 选择会话
zh_hant: 選擇會話

source: Send ({count})
ar: إرسال ({count})
ja: 送信 ({count})
ko: 보내기 ({count})
zh: 发送 ({count})
zh_hant: 發送 ({count})

source: Selected {count}
ar: تم تحديد {count}
ja: {count}件選択中
ko: {count}개 선택됨
zh: 已选择 {count} 条
zh_hant: 已選擇 {count} 條

source: Forward Individually
ar: إعادة توجيه فردي
ja: 個別に転送
ko: 개별 전달
zh: 逐条转发
zh_hant: 逐條轉發

# forwardMerged
source: Forward as Merged
ar: إعادة توجيه مدمج
ja: まとめて転送
ko: 병합 전달
zh: 合并转发
zh_hant: 合併轉發

source: Group Chat History
ar: سجل محادثة المجموعة
ja: グループチャット履歴
ko: 그룹 채팅 기록
zh: 群聊的聊天记录
zh_hant: 群聊的聊天記錄

# c2cChatHistoryFormat
source: {name}'s Chat History
ar: سجل دردشة {name}
ja: {name}のチャット履歴
ko: {name}의 채팅 기록
zh: {name}的聊天记录
zh_hant: {name}的聊天記錄

# chatHistoryForSomebodyFormat
source: Chat History of {name1} and {name2}
ar: سجل الدردشة لـ {name1} و {name2}
ja: {name1}と{name2}のチャット履歴
ko: {name1}와 {name2}의 채팅 기록
zh: {name1}和{name2}的聊天记录
zh_hant: {name1}和{name2}的聊天記錄

source: Recent Chats
ar: المحادثات الأخيرة
ja: 最近のチャット
ko: 최근 채팅
zh: 最近聊天
zh_hant: 最近聊天

# forwardCompatibleText
source: Please upgrade to view chat history
ar: يرجى الترقية لعرض سجل المحادثة
ja: チャット履歴を表示するにはアップグレードしてください
ko: 채팅 기록을 보려면 업그레이드하세요
zh: 请升级到最新版本查看聊天记录
zh_hant: 請升級到最新版本查看聊天記錄

# forwardFailedMessageTip
source: Failed messages cannot be forwarded!
ar: لا يمكن إعادة توجيه الرسائل الفاشلة!
ja: 送信失敗メッセージは転送できません！
ko: 전송 실패 메시지는 전달할 수 없습니다!
zh: 发送失败消息不支持转发！
zh_hant: 發送失敗訊息不支援轉發！

# forwardSeparateLimitTip
source: Too many messages selected, individual forwarding is not supported
ar: عدد الرسائل كبير جدًا، إعادة التوجيه الفردية غير مدعومة
ja: 選択したメッセージが多すぎます、個別転送はサポートされていません
ko: 선택한 메시지가 너무 많아 개별 전달이 지원되지 않습니다
zh: 转发消息过多，暂不支持逐条转发
zh_hant: 轉發訊息過多，暫不支援逐條轉發

# deleteMessagesConfirmTip
source: Are you sure you want to delete the selected messages?
ar: هل أنت متأكد من حذف الرسائل المحددة؟
ja: 選択したメッセージを削除しますか？
ko: 선택한 메시지를 삭제하시겠습니까?
zh: 确定删除已选消息？
zh_hant: 確定刪除已選消息？

# conversationListAtAll
source: [@All]
ar: [@الجميع]
ja: [@全員]
ko: [@전체]
zh: [@所有人]
zh_hant: [@所有人]

# conversationListAtMe
source: [@Me]
ar: [@أنا]
ja: [@自分]
ko: [@나]
zh: [有人@我]
zh_hant: [有人@我]

# messageInputAllMembers
source: All
ar: الجميع
ja: 全員
ko: 전체
zh: 所有人
zh_hant: 所有人

# selectMentionMember
source: Select Members
ar: اختر الأعضاء
ja: メンバーを選択
ko: 멤버 선택
zh: 选择提醒的人
zh_hant: 選擇提醒的人

source: Tap to remove
ar: اضغط للإزالة
ja: タップして削除
ko: 탭하여 제거
zh: 点击移除
zh_hant: 點擊移除

# messageTypeSecurityStrike
source: Sensitive content involved
ar: يتضمن محتوى حساس
ja: 機密コンテンツが含まれています
ko: 민감한 콘텐츠가 포함되어 있습니다
zh: 涉及敏感内容
zh_hant: 涉及敏感內容

source: Convert to Text
ar: تحويل إلى نص
ja: テキストに変換
ko: 텍스트로 변환
zh: 转文字
zh_hant: 轉文字

# convertToTextFailed
source: Unable to convert
ar: فشل التحويل
ja: 変換できません
ko: 변환할 수 없습니다
zh: 转换失败
zh_hant: 轉換失敗

source: Hide
ar: إخفاء
ja: 非表示
ko: 숨기기
zh: 隐藏
zh_hant: 隱藏

source: Copied
ar: تم النسخ
ja: コピーしました
ko: 복사됨
zh: 已复制
zh_hant: 已複製

source: Translate
ar: ترجمة
ja: 翻訳
ko: 번역
zh: 翻译
zh_hant: 翻譯

# translateFailed
source: Unable to translate
ar: فشلت الترجمة
ja: 翻訳できません
ko: 번역할 수 없습니다
zh: 翻译失败
zh_hant: 翻譯失敗

# translateDefaultTips
source: Translation powered by Tencent Cloud IM
ar: الترجمة مدعومة من Tencent Cloud IM
ja: Tencent Cloud IMによる翻訳
ko: Tencent Cloud IM 번역 제공
zh: 由腾讯云 IM 提供翻译支持
zh_hant: 由騰訊雲 IM 提供翻譯支持

source: Translating...
ar: جارٍ الترجمة...
ja: 翻訳中...
ko: 번역 중...
zh: 翻译中...
zh_hant: 翻譯中...

source: Translate Target Language
ar: لغة الترجمة المستهدفة
ja: 翻訳先言語
ko: 번역 대상 언어
zh: 翻译目标语言
zh_hant: 翻譯目標語言

# languageZh
source: 简体中文
zh_hant: 簡體中文
