Repository: iveshzf/TUIKit_Flutter
Catalog: atomic-x/lib/*_component/l10n/l10n_*.arb
Languages: ar, ja, ko, zh, zh_hant

source: Login
ar: تسجيل الدخول
ja: ログイン
ko: 로그인
zh: 登录
zh_hant: 登录

source: Logout
ar: تسجيل الخروج
ja: ログアウト
ko: 로그아웃
zh: 登出
zh_hant: 登出

source: Chat
ar: دردشة
ja: チャット
ko: 채팅
zh: 聊天
zh_hant: 對話

source: Settings
ar: الإعدادات
ja: 設定
ko: 설정
zh: 设置
zh_hant: 設定

source: Theme
ar: المظهر
ja: テーマ
ko: 테마
zh: 主题
zh_hant: 主題

# themeLight
source: Light
ar: فاتح
ja: 明るい
ko: 밝음
zh: 明亮
zh_hant: 明亮

# themeDark
source: Dark
ar: مظلم
ja: 暗い
ko: 어둠
zh: 暗黑
zh_hant: 暗黑

source: Follow System
ar: اتبع النظام
ja: システムに従う
ko: 시스템을 따르세요
zh: 跟随系统
zh_hant: 跟隨系統

source: Color
ar: لون
ja: 色
ko: 색상
zh: 颜色
zh_hant: 顏色

source: Language
ar: اللغة
ja: 言語
ko: 언어
zh: 语言
zh_hant: 語言

source: Confirm
ar: تأكيد
ja: 確認
ko: 확인
zh: 确定
zh_hant: 確定

source: Cancel
ar: إلغاء
ja: キャンセル
ko: 취소
zh: 取消
zh_hant: 取消

# contact
source: Contacts
ar: جهات الاتصال
ja: 連絡先
ko: 연락처
zh: 联系人
zh_hant: 聯絡人

# messageRevokedDefault
source: A user recalled a message
ar: قام مستخدم بسحب رسالة
ja: ユーザーがメッセージを取り消しました
ko: 사용자가 메시지를 철회했습니다
zh: 有用户撤回了一条消息
zh_hant: 有用戶撤回了一條消息

# messageRevokedBySelf
source: You recalled a message
ar: قمت بسحب رسالة
ja: あなたがメッセージを取り消しました
ko: 메시지를 철회했습니다
zh: 你撤回了一条消息
zh_hant: 你撤回了一條消息

# messageRevokedByOther
source: The other party recalled a message
ar: قام الطرف الآخر بسحب رسالة
ja: 相手がメッセージを取り消しました
ko: 상대방이 메시지를 철회했습니다
zh: 对方撤回了一条消息
zh_hant: 對方撤回了一條消息

# messageRevokedByUser
source: {user} recalled a message
ar: قام {user} بسحب رسالة
ja: {user} がメッセージを取り消しました
ko: {user}님이 메시지를 철회했습니다
zh: {user} 撤回了一条消息
zh_hant: {user} 撤回了一條消息

# groupMemberJoined
source: {user} joined the group
ar: انضم {user} إلى المجموعة
ja: {user} がグループに参加しました
ko: {user}님이 그룹에 참여했습니다
zh: {user} 加入了群组
zh_hant: {user} 加入了群組

# groupMemberInvited
source: {operator} invited {users} to join the group
ar: دعا {operator} {users} للانضمام إلى المجموعة
ja: {operator} が {users} をグループに招待しました
ko: {operator}님이 {users}님을 그룹에 초대했습니다
zh: {operator} 邀请 {users} 加入了群组
zh_hant: {operator} 邀請 {users} 加入了群組

# groupMemberQuit
source: {user} left the group
ar: غادر {user} المجموعة
ja: {user} がグループを退出しました
ko: {user}님이 그룹을 나갔습니다
zh: {user} 退出了群组
zh_hant: {user} 退出了群組

# groupMemberKicked
source: {operator} removed {users} from the group
ar: أزال {operator} {users} من المجموعة
ja: {operator} が {users} をグループから削除しました
ko: {operator}님이 {users}님을 그룹에서 내보냈습니다
zh: {operator} 将 {users} 踢出了群组
zh_hant: {operator} 將 {users} 踢出了群組

# groupAdminSet
source: {users} were set as administrators
ar: تم تعيين {users} كمشرفين
ja: {users} が管理者に設定されました
ko: {users}님이 관리자로 설정되었습니다
zh: {users} 被设置为管理员
zh_hant: {users} 被設置為管理員

# groupAdminCancelled
source: {users} were removed from administrators
ar: تم إلغاء صلاحيات المشرف لـ {users}
ja: {users} の管理者権限が取り消されました
ko: {users}님의 관리자 권한이 취소되었습니다
zh: {users} 被取消了管理员资格
zh_hant: {users} 被取消了管理員資格

# groupMessagePinned
source: {user} pinned a message
ar: قام {user} بتثبيت رسالة
ja: {user} がメッセージをピン留めしました
ko: {user}님이 메시지를 고정했습니다
zh: {user} 置顶了一条消息
zh_hant: {user} 置頂了一條消息

# groupMessageUnpinned
source: {user} unpinned a message
ar: قام {user} بإلغاء تثبيت رسالة
ja: {user} がメッセージのピン留めを解除しました
ko: {user}님이 메시지 고정을 해제했습니다
zh: {user} 取消了一条消息置顶
zh_hant: {user} 取消了一條消息置頂

source: You
ar: أنت
ja: あなた
ko: 당신
zh: 你
zh_hant: 你

source: muted
ar: تم كتم الصوت
ja: ミュートされました
ko: 음소거됨
zh: 被禁言
zh_hant: 被禁言

source: unmuted
ar: تم إلغاء كتم الصوت
ja: ミュートが解除されました
ko: 음소거 해제됨
zh: 被解除禁言
zh_hant: 被解除禁言

source: day
ar: يوم
ja: 日
ko: 일
zh: 天
zh_hant: 天

source: hour
ar: ساعة
ja: 時間
ko: 시간
zh: 小时
zh_hant: 小時

source: min
ar: دقيقة
ja: 分
ko: 분
zh: 分钟
zh_hant: 分鐘

# second
source: sec
ar: ثانية
ja: 秒
ko: 초
zh: 秒
zh_hant: 秒

# messageTypeImage
source: [Image]
ar: [صورة]
ja: [画像]
ko: [이미지]
zh: [图片]
zh_hant: [圖片]

# messageTypeVoice
source: [Voice]
ar: [صوت]
ja: [音声]
ko: [음성]
zh: [语音]
zh_hant: [語音]

# messageTypeFile
source: [File]
ar: [ملف]
ja: [ファイル]
ko: [파일]
zh: [文件]
zh_hant: [文件]

# messageTypeVideo
source: [Video]
ar: [فيديو]
ja: [動画]
ko: [비디오]
zh: [视频]
zh_hant: [視頻]

# messageTypeSticker
source: [Sticker]
ar: [ملصق]
ja: [スタンプ]
ko: [스티커]
zh: [动画表情]
zh_hant: [動畫表情]

# messageTypeCustom
source: [Custom Message]
ar: [رسالة مخصصة]
ja: [カスタムメッセージ]
ko: [사용자 정의 메시지]
zh: [自定义消息]
zh_hant: [自定義消息]

# groupNameChangedTo
source: changed group name to
ar: تم تغيير اسم المجموعة إلى
ja: グループ名を変更しました：
ko: 그룹 이름을 변경했습니다:
zh: 修改群名称为
zh_hant: 修改群名稱為

# groupIntroChangedTo
source: changed group description to
ar: تم تغيير وصف المجموعة إلى
ja: グループ紹介を変更しました：
ko: 그룹 소개를 변경했습니다:
zh: 修改群简介为
zh_hant: 修改群簡介為

# groupNoticeChangedTo
source: changed group notice to
ar: تم تغيير إشعار المجموعة إلى
ja: グループ通知を変更しました：
ko: 그룹 공지를 변경했습니다:
zh: 修改群公告为
zh_hant: 修改群公告為

# groupNoticeDeleted
source: deleted group notice
ar: تم حذف إشعار المجموعة
ja: グループ通知を削除しました
ko: 그룹 공지를 삭제했습니다
zh: 删除了群公告
zh_hant: 刪除了群公告

# groupAvatarChanged
source: changed group avatar
ar: تم تغيير صورة المجموعة
ja: グループアバターを変更しました
ko: 그룹 아바타를 변경했습니다
zh: 修改了群头像
zh_hant: 修改了群頭像

# groupOwnerTransferredTo
source: transferred group ownership to
ar: تم نقل ملكية المجموعة إلى
ja: グループオーナーを譲渡しました：
ko: 그룹 소유권을 이전했습니다:
zh: 将群主转让给
zh_hant: 將群主轉讓給

# groupMuteAllEnabled
source: enabled mute all members
ar: تم تفعيل كتم الصوت للجميع
ja: 全員ミュートを有効にしました
ko: 전체 음소거를 활성화했습니다
zh: 开启了全员禁言
zh_hant: 開啟了全員禁言

# groupMuteAllDisabled
source: disabled mute all members
ar: تم إلغاء كتم الصوت للجميع
ja: 全員ミュートを無効にしました
ko: 전체 음소거를 비활성화했습니다
zh: 关闭了全员禁言
zh_hant: 關閉了全員禁言

source: Unknown
ar: غير معروف
ja: 不明
ko: 알 수 없음
zh: 未知
zh_hant: 未知

# groupJoinMethodChangedTo
source: changed join method to
ar: تم تغيير طريقة الانضمام إلى
ja: 参加方法を変更しました：
ko: 참여 방법을 변경했습니다:
zh: 修改了入群方式为
zh_hant: 修改了入群方式為

# groupInviteMethodChangedTo
source: changed invite method to
ar: تم تغيير طريقة الدعوة إلى
ja: 招待方法を変更しました：
ko: 초대 방법을 변경했습니다:
zh: 修改了邀请方式为
zh_hant: 修改了邀請方式為

# weekdaySunday
source: Sun
ar: الأحد
ja: 日
ko: 일
zh: 周日
zh_hant: 週日

# weekdayMonday
source: Mon
ar: الاثنين
ja: 月
ko: 월
zh: 周一
zh_hant: 週一

# weekdayTuesday
source: Tue
ar: الثلاثاء
ja: 火
ko: 화
zh: 周二
zh_hant: 週二

# weekdayWednesday
source: Wed
ar: الأربعاء
ja: 水
ko: 수
zh: 周三
zh_hant: 週三

# weekdayThursday
source: Thu
ar: الخميس
ja: 木
ko: 목
zh: 周四
zh_hant: 週四

# weekdayFriday
source: Fri
ar: الجمعة
ja: 金
ko: 금
zh: 周五
zh_hant: 週五

# weekdaySaturday
source: Sat
ar: السبت
ja: 土
ko: 토
zh: 周六
zh_hant: 週六

source: User ID
ar: معرف المستخدم
ja: ユーザーID
ko: 사용자 ID
zh: 用户ID
zh_hant: 用戶ID

source: Album
ar: ألبوم
ja: アルバム
ko: 앨범
zh: 相册
zh_hant: 相册

source: File
ar: ملف
ja: ファイル
ko: 파일
zh: 文件
zh_hant: 文件

source: Take a photo
ar: التقاط صورة
ja: 写真
ko: 사진
zh: 拍照
zh_hant: 拍照

source: Record a video
ar: تسجيل فيديو
ja: ビデオ
ko: 동영상
zh: 摄像
zh_hant: 錄製

source: Send
ar: يرسل
ja: 送信
ko: 보내다
zh: 发送
zh_hant: 傳送

# sendSoundTips
source: Press and hold to speak Release to send
ar: اضغط مع الاستمرار للتحدث، ثم حرر للإرسال
ja: 長押しすると話します。離すと送信します。
ko: 길게 눌러 말하기, 놓으면 보내기
zh: 按住说话 松开发送
zh_hant: 按住說話 松開發送

source: More
ar: المزيد
ja: もっと
ko: 더보기
zh: 更多
zh_hant: 更多

source: Delete
ar: حذف
ja: 削除
ko: 삭제
zh: 删除
zh_hant: 刪除

# clearMessage
source: Clear chat history
ar: مسح سجل الدردشة
ja: チャット履歴を消去
ko: 채팅 기록 삭제
zh: 清除聊天记录
zh_hant: 清除聊天記錄

# pin
source: Pin chat
ar: تثبيت الدردشة
ja: チャットをピン留め
ko: 채팅 고정
zh: 置顶聊天
zh_hant: 置頂聊天

# unpin
source: Unpin chat
ar: إلغاء التثبيت
ja: ピン留めを解除
ko: 고정 해제
zh: 取消置顶
zh_hant: 取消置頂

# startConversation
source: New Chat
ar: ابدأ جلسة
ja: セッションを開始する
ko: 세션 시작
zh: 发起会话
zh_hant: 發起會話

source: Create Group Chat
ar: إنشاء دردشة جماعية
ja: グループチャットを作成する
ko: 그룹 채팅 만들기
zh: 创建群聊
zh_hant: 創建群聊

# addFriend
source: Add friends
ar: أضف أصدقاء
ja: 友達を追加
ko: 친구 추가
zh: 添加好友
zh_hant: 新增好友

source: Add Group
ar: إضافة مجموعة
ja: グループを追加
ko: 그룹 추가
zh: 添加群组
zh_hant: 加群組

# createGroupTips
source: Create Group
ar: إنشاء مجموعة
ja: グループの作成
ko: 그룹 만들기
zh: 创建群组
zh_hant: 創建群組

source: Create Community
ar: إنشاء مجتمع
ja: コミュニティを作成する
ko: 커뮤니티 만들기
zh: 创建社群
zh_hant: 創建社群

# groupIDInvalid
source: Invalid group ID. Check whether the group ID is correct.
ar: معرف المجموعة غير صالح، يرجى التحقق من صحة معرف المجموعة
ja: グループIDが無効です。グループIDが正しく入力されているか確認してください。
ko: 그룹 ID가 잘못되었습니다. 그룹 ID를 올바르게 입력했는지 확인하세요.
zh: 群组 ID 非法，请检查群组 ID 是否填写正确。
zh_hant: 群組 ID 非法，請檢查群組 ID 是否填寫正確。

# communityIDEditFormatTips
source: Community ID prefix must be @TGS#_ !
ar: يجب أن يكون معرف المجتمع مسبوقًا بـ @TGS#_!
ja: コミュニティ ID には接頭辞として @TGS#_ を付ける必要があります。
ko: 커뮤니티 ID 앞에는 @TGS#_가 붙어야 합니다!
zh: 社群 ID 前缀必须为 @TGS#_ !
zh_hant: 社群 ID 前綴必須為 @TGS#_ !

# groupIDEditFormatTips
source: Group ID prefix cannot be @TGS# !
ar: ا يمكن أن يكون بادئة معرف المجموعة @TGS# !
ja: グループ ID プレフィックスを @TGS# にすることはできません。
ko: 그룹 ID 접두사는 @TGS#일 수 없습니다!
zh: 群组 ID 前缀不能为 @TGS# !
zh_hant: 群組 ID 前綴不能為 @TGS# !

# groupIDEditExceedTips
source: Group ID up to 48 bytes!
ar: يجب أن يكون معرف المجموعة أقل من 48 بايت!
ja: グループ ID は最大 48 バイトです。
ko: 그룹 ID는 최대 48바이트까지 가능합니다!
zh: 群组 ID 最长 48 字节!
zh_hant: 群組 ID 最長 48 字節!

# productDocumentation
source: View product documentation
ar: عرض دليل المنتج
ja: 製品ドキュメントを表示する
ko: 제품 설명서 보기
zh: 查看产品文档
zh_hant: 查看產品文檔

source: Create
ar: إنشاء
ja: 作成する
ko: 만들다
zh: 创建
zh_hant: 創建

source: Group Name
ar: اسم المجموعة
ja: グループ名
ko: 그룹 이름
zh: 群名称
zh_hant: 群名稱

# groupIDOption
source: Group ID (optional)
ar: معرف المجموعة (اختياري)
ja: グループID (オプション)
ko: 그룹 ID(선택사항)
zh: 群ID（选填）
zh_hant: 群ID (選填)

# groupFaceUrl
source: Group Avatar
ar: صورة رمزية للمجموعة
ja: グループアバター
ko: 그룹 아바타
zh: 群头像
zh_hant: 群頭像

# groupMemberSelected
source: Participants
ar: الأعضاء المحددين في المجموعة
ja: 選択されたグループメンバー
ko: 선택된 그룹 구성원
zh: 已选择的群成员
zh_hant: 已選擇的群成員

# groupWorkType
source: Friends Working group(Work)
ar: مجموعة عمل الأصدقاء (Work)
ja: お疲れ様グループ（仕事）
ko: 좋은 직업 그룹 (일)
zh: 好友工作群(Work)
zh_hant: 好友工作群(Work)

# groupPublicType
source: Stranger Social group(Public）
ar: مجموعة تواصل الغرباء (Public)
ja: ストレンジャー ソーシャル グループ (パブリック)
ko: 낯선 소셜 그룹(공개)
zh: 陌生人社交群(Public)
zh_hant: 陌生人社交群(Public)

# groupMeetingType
source: Temporary Meeting group(Meeting）
ar: مجموعة اجتماعات مؤقتة (Meeting)
ja: 臨時会議グループ（会議）
ko: 임시 회의 그룹 (회의)
zh: 临时会议群(Meeting)
zh_hant: 臨時會議群(Meeting)

# groupCommunityType
source: Community(Community)
ar: مجتمع (Community)
ja: コミュニティ
ko: 지역 사회
zh: 社群(Community)
zh_hant: 社群(Community)

# groupWorkDesc
source: Friends work group (Work): Similar to ordinary WeChat groups, after creation, only friends who are already in the group can be invited to join the group, and there is no need for the approval of the invitee or the approval of the group owner.
ar: مجموعة عمل الأصدقاء (Work): تشبه محادثات WeChat العادية، بعد الإنشاء، يمكن للأصدقاء الموجودين في المجموعة دعوة أصدقائهم للانضمام دون الحاجة إلى موافقة المضافين أو الموافقة من قبل مالك المجموعة.
ja: 友達ワークグループ（Work）：通常のWeChatグループと同様に、作成後はすでにグループに参加している友達のみをグループに招待でき、招待された側の同意やグループの承認は必要ありません。所有者。
ko: 친구 작업 그룹(Work) : 일반 위챗 그룹과 유사하게 생성 후, 이미 그룹에 속한 친구만 그룹에 초대할 수 있으며, 초대한 당사자의 동의나 그룹의 승인이 필요하지 않습니다. 소유자.
zh: 好友工作群(Work）：类似普通微信群，创建后仅支持已在群内的好友邀请加群，且无需被邀请方同意或群主审批。
zh_hant: 好友工作群(Work）：類似普通微信群，創建後僅支持已在群內的好友邀請加群，且無需被邀請方同意或群主審批。

# groupPublicDesc
source: Stranger social group (Public): Similar to QQ group, the group owner can designate the group administrator after creation. After the user searches for the group ID and initiates a group application, the group owner or administrator must approve it before joining the group.
ar: مجموعة تواصل الغرباء (Public): تشبه مجموعات QQ، بعد الإنشاء، يمكن لمالك المجموعة تعيين مشرفين للمجموعة، عندما يبحث المستخدمون عن معرف المجموعة ويطلبون الانضمام، يجب عليهم الحصول على موافقة من مالك المجموعة أو المشرفين قبل الانضمام إلى المجموعة.
ja: 見知らぬソーシャル グループ (パブリック): QQ グループと同様に、グループ所有者は作成後にグループ管理者を指定できます。ユーザーがグループ ID を検索してグループへの参加申請を開始した後、グループに参加する前にグループ所有者または管理者の承認が必要です。 。
ko: 낯선 소셜 그룹(공개): QQ 그룹과 마찬가지로 그룹 생성 후 그룹 소유자가 그룹 관리자를 지정할 수 있습니다. 사용자가 그룹 ID를 검색하고 그룹 가입 신청을 시작한 후 그룹에 가입하기 전에 그룹 소유자 또는 관리자의 승인이 필요합니다. .
zh: 陌生人社交群(Public）：类似 QQ 群，创建后群主可以指定群管理员，用户搜索群 ID 发起加群申请后，需要群主或管理员审批通过才能入群。
zh_hant: 陌生人社交群(Public）：類似 QQ 群，創建後群主可以指定群管理員，用戶搜索群 ID 發起加群申請後，需要群主或管理員審批通過才能入群。

# groupMeetingDesc
source: Temporary meeting group (Meeting): After creation, you can enter and leave at will, and support viewing of messages before joining the group; it is suitable for audio and video conference scenarios, online education scenarios, and other scenarios that are combined with real-time audio and video products.
ar: مجموعة اجتماعات مؤقتة (Meeting): بعد الإنشاء، يمكن للمستخدمين الانضمام والخروج من المجموعة بحرية، ويمكنهم عرض الرسائل قبل الانضمام إلى المجموعة. تستخدم هذه المجموعات في سيناريوهات الاجتماعات الصوتية والمرئية والتعليم عبر الإنترنت وغيرها من السيناريوهات التي تتطلب منتجات الصوت والفيديو الفورية.
ja: 一時的な会議グループ (会議): 作成後は自由に出入りでき、グループに参加する前にメッセージの表示をサポートするため、音声会議やビデオ会議のシナリオ、オンライン教育のシナリオ、およびリアルタイム音声と組み合わせたその他のシナリオに適しています。そしてビデオ製品。
ko: 임시 회의 그룹(Meeting): 생성 후 마음대로 입장 및 퇴장할 수 있으며, 그룹에 참여하기 전 메시지 보기를 지원합니다. 음성 및 영상 회의 시나리오, 온라인 교육 시나리오 및 실시간 오디오와 결합된 기타 시나리오에 적합합니다. 그리고 비디오 제품.
zh: 临时会议群(Meeting）：创建后可以随意进出，且支持查看入群前消息；适用于音视频会议场景、在线教育场景等与实时音视频产品结合的场景。
zh_hant: 臨時會議群(Meeting）：創建後可以隨意進出，且支持查看入群前消息；適用於音視頻會議場景、在線教育場景等與實時音視頻產品結合的場景。

# groupCommunityDesc
source: Community(Community)：After creation, you can enter and leave at will, support up to 100,000 people, support historical message storage, and after users search for group ID and initiate a group application, they can join the group without administrator approval.
ar: المجتمع (Community): بعد الإنشاء يمكن الدخول والخروج بحرية، يدعم حتى 100000 شخص، يدعم تخزين الرسائل السابقة، بعد البحث عن معرف المجموعة وإرسال طلب الانضمام، يمكن الانضمام إلى المجموعة دون حاجة لموافقة المشرف.
ja: コミュニティ: 作成後は自由に参加および退出でき、最大 100,000 人のユーザーがグループ ID を検索してグループ アプリケーションを開始すると、管理者の承認なしでグループに参加できます。
ko: 커뮤니티: 생성 후 자유롭게 입장 및 탈퇴가 가능하며, 기록 메시지 저장을 지원하며, 사용자가 그룹 ID를 검색하고 그룹 신청을 한 후 관리자 승인 없이 그룹에 가입할 수 있습니다.
zh: 社群(Community)：创建后可以随意进出，最多支持100000人，支持历史消息存储，用户搜索群 ID 发起加群申请后，无需管理员审批即可进群。
zh_hant: 社群(Community)：創建後可以隨意進出，最多支持100000人，支持歷史消息存儲，用戶搜索群 ID 發起加群申請後，無需管理員審批即可進群。

# groupDetail
source: Group Chat Details
ar: تفاصيل المحادثة الجماعية
ja: グループチャットの詳細
ko: 그룹 채팅 세부정보
zh: 群聊详情
zh_hant: 群聊詳情

source: Transfer Group Owner
ar: نقل ملكية المجموعة
ja: グループ所有者を転送する
ko: 그룹 소유자 이전
zh: 转让群主
zh_hant: 轉讓群主

# privateGroup
source: Discussion Group
ar: محادثة فردية
ja: ディスカッショングループ
ko: 토론 그룹
zh: 讨论组
zh_hant: 討論組

source: Public Group
ar: مجموعة عامة
ja: パブリックグループ
ko: 공개 그룹
zh: 公开群
zh_hant: 公開群

source: Chatroom
ar: غرفة الدردشة
ja: チャットルーム
ko: 대화방
zh: 聊天室
zh_hant: 聊天室

# communityGroup
source: Community
ar: مجموعة المجتمع
ja: コミュニティ
ko: 지역 사회
zh: 社群
zh_hant: 社群

# groupOfAnnouncement
source: Group Notice
ar: إشعار المجموعة
ja: グループ通知
ko: 그룹 공지
zh: 群公告
zh_hant: 群通知

# groupManagement
source: Manage Group
ar: إدارة المجموعة
ja: グループ管理
ko: 그룹 관리
zh: 群管理
zh_hant: 管理群組

source: Group Type
ar: نوع المجموعة
ja: グループタイプ
ko: 그룹 유형
zh: 群类型
zh_hant: 群組類型

# addGroupWay
source: Group Joining Method
ar: طريقة الانضمام النشطة
ja: グループに参加するための積極的な方法
ko: 그룹에 참여하는 적극적인 방법
zh: 主动加群方式
zh_hant: 主動加群方式

# inviteGroupType
source: Group Inviting Method
ar: طريقة الدعوة للانضمام
ja: グループに招待する方法
ko: 그룹에 초대하는 방법
zh: 邀请进群方式
zh_hant: 邀請進群方式

source: My Alias in Group
ar: لقبي في المجموعة
ja: グループ内の私のエイリアス
ko: 그룹에서의 별칭
zh: 我的群昵称
zh_hant: 我在群裡嘅別名

# doNotDisturb
source: Mute Notifications
ar: عدم إزعاج
ja: メッセージを邪魔しないでください
ko: 방해 금지 메시지
zh: 消息免打扰
zh_hant: 消息免打擾

# groupMember
source: Group Members
ar: أعضاء المجموعة
ja: グループメンバー
ko: 그룹 구성원
zh: 群成员
zh_hant: 群成員

# profileRemark
source: Alias
ar: اسم الملاحظات
ja: 備考
ko: 비고
zh: 备注
zh_hant: 備註

# groupEdit
source: Edit
ar: تحرير
ja: 編集
ko: 편집하다
zh: 编辑
zh_hant: 編輯

# blackList
source: Blocked List
ar: قائمة الحظر
ja: ブラックリスト
ko: 블랙리스트
zh: 黑名单
zh_hant: 黑名單

# profileBlack
source: Block
ar: إضافة إلى القائمة السوداء
ja: ブラックリストに追加
ko: 블랙리스트에 추가
zh: 加入黑名单
zh_hant: 加入黑名單

# deleteFriend
source: Delete Contact
ar: حذف الصديق
ja: 友達を削除する
ko: 친구 삭제하기
zh: 删除好友
zh_hant: 刪除好友

source: Search
ar: بحث
ja: 検索
ko: 검색
zh: 搜索
zh_hant: 搜尋

source: Chat History
ar: سجل المحادثة
ja: チャット履歴
ko: 채팅 기록
zh: 聊天记录
zh_hant: 聊天記錄

source: Groups
ar: المجموعات
ja: グループ
ko: 그룹
zh: 群组
zh_hant: 群組

# newFriend
source: New Contacts
ar: جهات اتصال جديدة
ja: 新しい連絡先
ko: 새로운 연락처
zh: 新的联系人
zh_hant: 新的聯繫人

# myGroups
source: Group Chats
ar: مجموعاتي
ja: 私のグループチャット
ko: 내 그룹 채팅
zh: 我的群聊
zh_hant: 我的群聊

# contactInfo
source: Details
ar: تفاصيل
ja: 詳細
ko: 세부
zh: 详细资料
zh_hant: 詳細資料

# includeGroupMembers
source: Include members:
ar: الأعضاء المشمولون:
ja: 含まれるメンバー:
ko: 포함된 멤버:
zh: 包含成员:
zh_hant: 包含成員:

# tuiEmojiSmile
source: [Smile]
ar: [ابتسامة]
ja: [微笑]
ko: [미소]
zh: [微笑]
zh_hant: [微笑]

# tuiEmojiExpect
source: [Expect]
ar: [توقع]
ja: [期待]
ko: [기대]
zh: [期待]
zh_hant: [期待]

# tuiEmojiBlink
source: [Blink]
ar: [غمز]
ja: [ウィンク]
ko: [눈짓]
zh: [眨眼]
zh_hant: [眨眼]

# tuiEmojiGuffaw
source: [Guffaw]
ar: [ضحكة عالية]
ja: [大笑い]
ko: [큰 웃음]
zh: [大笑]
zh_hant: [大笑]

# tuiEmojiKindSmile
source: [Kind Smile]
ar: [ابتسامة لطيفة]
ja: [おばさん笑い]
ko: [이모티콘 웃음]
zh: [姨母笑]
zh_hant: [姨母笑]

# tuiEmojiHaha
source: [Haha]
ar: [هاها]
ja: [ははは]
ko: [하하하]
zh: [哈哈哈]
zh_hant: [哈哈哈]

# tuiEmojiCheerful
source: [Cheerful]
ar: [مرح]
ja: [楽しい]
ko: [즐거움]
zh: [愉快]
zh_hant: [愉快]

# tuiEmojiSpeechless
source: [Speechless]
ar: [بلا كلمات]
ja: [呆れ]
ko: [말문이 막혀]
zh: [无语]
zh_hant: [無語]

# tuiEmojiAmazed
source: [Amazed]
ar: [مدهش]
ja: [驚き]
ko: [놀라움]
zh: [惊讶]
zh_hant: [驚訝]

# tuiEmojiSorrow
source: [Sorrow]
ar: [حزن]
ja: [悲しみ]
ko: [슬픔]
zh: [悲伤]
zh_hant: [悲傷]

# tuiEmojiComplacent
source: [Complacent]
ar: [راض]
ja: [得意げ]
ko: [만족]
zh: [得意]
zh_hant: [得意]

# tuiEmojiSilly
source: [Silly]
ar: [ضحكة غبية]
ja: [バカ]
ko: [바보 같음]
zh: [傻了]
zh_hant: [傻了]

# tuiEmojiLustful
source: [Lustful]
ar: [شهواني]
ja: [色気]
ko: [음란]
zh: [色]
zh_hant: [色]

# tuiEmojiGiggle
source: [Giggle]
ar: [قهقهة]
ja: [にこにこ笑い]
ko: [어린아이처럼 웃음]
zh: [憨笑]
zh_hant: [憨笑]

# tuiEmojiKiss
source: [Kiss]
ar: [قبلة]
ja: [キス]
ko: [키스]
zh: [亲亲]
zh_hant: [親親]

# tuiEmojiWail
source: [Wail]
ar: [بكاء]
ja: [大泣き]
ko: [비명]
zh: [大哭]
zh_hant: [大哭]

# tuiEmojiTearsLaugh
source: [Tears Laugh]
ar: [ضحك حتى الدموع]
ja: [泣き笑い]
ko: [울면서 웃음]
zh: [哭笑]
zh_hant: [哭笑]

# tuiEmojiTrapped
source: [Trapped]
ar: [محاصر]
ja: [困った]
ko: [곤란함]
zh: [困]
zh_hant: [困]

# tuiEmojiMask
source: [Mask]
ar: [قناع]
ja: [マスク]
ko: [마스크]
zh: [口罩]
zh_hant: [口罩]

# tuiEmojiFear
source: [Fear]
ar: [خوف]
ja: [恐怖]
ko: [공포]
zh: [恐惧]
zh_hant: [恐懼]

# tuiEmojiBareTeeth
source: [Bare Teeth]
ar: [أسنان عارية]
ja: [牙をむく]
ko: [이를 드러냄]
zh: [龇牙]
zh_hant: [齜牙]

# tuiEmojiFlareUp
source: [Flare Up]
ar: [غضب]
ja: [怒り]
ko: [분노]
zh: [发怒]
zh_hant: [發怒]

# tuiEmojiYawn
source: [Yawn]
ar: [تثاؤب]
ja: [あくび]
ko: [잠옷]
zh: [打哈欠]
zh_hant: [打哈欠]

# tuiEmojiTact
source: [Tact]
ar: [دهاء]
ja: [機知]
ko: [기지]
zh: [机智]
zh_hant: [機智]

# tuiEmojiStareyes
source: [Stareyes]
ar: [عيون النجوم]
ja: [星目]
ko: [별눈]
zh: [星星眼]
zh_hant: [星星眼]

# tuiEmojiShutUp
source: [Shut Up]
ar: [أغلق فمك]
ja: [黙れ]
ko: [입 다물기]
zh: [闭嘴]
zh_hant: [閉嘴]

# tuiEmojiSigh
source: [Sigh]
ar: [تنهد]
ja: [ため息]
ko: [한숨]
zh: [叹气]
zh_hant: [嘆氣]

# tuiEmojiHehe
source: [Hehe]
ar: [ههه]
ja: [へへ]
ko: [헤헤]
zh: [呵呵]
zh_hant: [呵呵]

# tuiEmojiSilent
source: [Silent]
ar: [صامت]
ja: [静か]
ko: [조용]
zh: [收声]
zh_hant: [收聲]

# tuiEmojiSurprised
source: [Surprised]
ar: [متفاجئ]
ja: [驚喜]
ko: [놀라움]
zh: [惊喜]
zh_hant: [驚喜]

# tuiEmojiAskance
source: [Askance]
ar: [نظرة جانبية]
ja: [白目]
ko: [불만의 눈길]
zh: [白眼]
zh_hant: [白眼]

# tuiEmojiOk
source: [OK]
ar: [حسنا]
ko: [확인]

# tuiEmojiShit
source: [Shit]
ar: [براز]
ja: [うんち]
ko: [똥]
zh: [便便]
zh_hant: [便便]

# tuiEmojiMonster
source: [Monster]
ar: [وحش]
ja: [モンスター]
ko: [몬스터]
zh: [怪兽]
zh_hant: [怪獸]

# tuiEmojiDaemon
source: [Daemon]
ar: [شيطان]
ja: [悪魔]
ko: [악마]
zh: [恶魔]
zh_hant: [惡魔]

# tuiEmojiRage
source: [Rage]
ar: [غضب]
ja: [悪魔の怒り]
ko: [악마의 분노]
zh: [恶魔怒]
zh_hant: [惡魔怒]

# tuiEmojiFool
source: [Fool]
ar: [أحمق]
ja: [ダメ]
ko: [바보]
zh: [衰]
zh_hant: [衰]

# tuiEmojiPig
source: [Pig]
ar: [خنزير]
ja: [豚]
ko: [돼지]
zh: [猪]
zh_hant: [豬]

# tuiEmojiCow
source: [Cow]
ar: [بقرة]
ja: [牛]
ko: [소]
zh: [牛]
zh_hant: [牛]

# tuiEmojiAi
source: [AI]
ar: [الذكاء الصناعي]

# tuiEmojiSkull
source: [Skull]
ar: [جمجمة]
ja: [骸骨]
ko: [해골]
zh: [骷髅]
zh_hant: [骷髏]

# tuiEmojiBombs
source: [Bombs]
ar: [قنابل]
ja: [爆弾]
ko: [폭탄]
zh: [炸弹]
zh_hant: [炸彈]

# tuiEmojiCoffee
source: [Coffee]
ar: [قهوة]
ja: [コーヒー]
ko: [커피]
zh: [咖啡]
zh_hant: [咖啡]

# tuiEmojiCake
source: [Cake]
ar: [كعكة]
ja: [ケーキ]
ko: [케이크]
zh: [蛋糕]
zh_hant: [蛋糕]

# tuiEmojiBeer
source: [Beer]
ar: [بيرة]
ja: [ビール]
ko: [맥주]
zh: [啤酒]
zh_hant: [啤酒]

# tuiEmojiFlower
source: [Flower]
ar: [زهرة]
ja: [花]
ko: [꽃]
zh: [花]
zh_hant: [花]

# tuiEmojiWatermelon
source: [Watermelon]
ar: [بطيخ]
ja: [スイカ]
ko: [수박]
zh: [瓜]
zh_hant: [瓜]

# tuiEmojiRich
source: [Rich]
ar: [غني]
ja: [お金持ち]
ko: [부자]
zh: [壕]
zh_hant: [壕]

# tuiEmojiHeart
source: [Heart]
ar: [قلب]
ja: [ハート]
ko: [하트]
zh: [爱心]
zh_hant: [愛心]

# tuiEmojiMoon
source: [Moon]
ar: [قمر]
ja: [月]
ko: [달]
zh: [月亮]
zh_hant: [月亮]

# tuiEmojiSun
source: [Sun]
ar: [شمس]
ja: [太陽]
ko: [태양]
zh: [太阳]
zh_hant: [太陽]

# tuiEmojiStar
source: [Star]
ar: [نجمة]
ja: [星]
ko: [별]
zh: [星星]
zh_hant: [星星]

# tuiEmojiRedPacket
source: [Red Packet]
ar: [حزمة حمراء]
ja: [レッドパケット]
ko: [빨간 봉투]
zh: [红包]
zh_hant: [红包]

# tuiEmojiCelebrate
source: [Celebrate]
ar: [احتفال]
ja: [祝賀]
ko: [축하]
zh: [庆祝]
zh_hant: [慶祝]

# tuiEmojiBless
source: [Bless]
ar: [بركة]
ja: [福]
ko: [복]
zh: [福]
zh_hant: [福]

# tuiEmojiFortune
source: [Fortune]
ar: [ثروة]
ja: [発財]
ko: [행운]
zh: [发]
zh_hant: [發]

# tuiEmojiConvinced
source: [Convinced]
ar: [مقتنع]
ja: [納得]
ko: [동의]
zh: [服]
zh_hant: [服]

# tuiEmojiProhibit
source: [Prohibit]
ar: [ممنوع]
ja: [禁止]
ko: [금지]
zh: [禁]
zh_hant: [禁]

# tuiEmojiKnife
source: [Knife]
ar: [سكين]
ja: [ナイフ]
ko: [칼]
zh: [刀]
zh_hant: [刀]

# tuiEmojiLike
source: [Like]
ar: [أعجبني]
ja: [いいね]
ko: [좋아요]
zh: [赞]
zh_hant: [讚]

source: Send Message
ar: إرسال رسالة
ja: メッセージを送信
ko: 메시지 보내기
zh: 发送消息
zh_hant: 發送消息

source: Add Members
ar: إضافة أعضاء
ja: メンバー追加
ko: 멤버 추가
zh: 添加成员
zh_hant: 加成員

# quitGroup
source: Leave
ar: الخروج من المحادثة الجماعية
ja: グループチャットを終了する
ko: 그룹 채팅 종료
zh: 退出群聊
zh_hant: 退出群聊

# dismissGroup
source: Disband Group
ar: حل المجموعة
ja: グループを解散する
ko: 그룹을 해체하다
zh: 解散该群
zh_hant: 解散該群

# groupNoticeEmpty
source: No group notice
ar: لا يوجد إعلانات حاليًا.
ja: グループの発表はまだありません
ko: 아직 그룹 공지가 없습니다
zh: 暂无群公告
zh_hant: 暫無群公告

source: Next
ar: التالى
ja: 次へ
ko: 다음
zh: 下一步
zh_hant: 下一步

# agree
source: Accept
ar: قبول
ja: 承認
ko: 수락
zh: 同意
zh_hant: 接受

source: Accept
ar: قبول
ja: 承認
ko: 수락
zh: 接受
zh_hant: 接受

# refuse
source: Decline
ar: رفض
ja: 拒否
ko: 거절
zh: 拒绝
zh_hant: 拒絕

# noFriendApplicationList
source: Friend request is empty
ar: لا توجد طلبات صداقة جديدة
ja: 新しい連絡先リクエストはありません
ko: 새로운 연락처 요청이 없습니다
zh: 暂无新的联系人请求
zh_hant: 暫無新的聯絡人請求

# noBlackList
source: Block list is empty
ar: لا يوجد أصدقاء في القائمة السوداء
ja: ブラックリストに登録されたユーザーはいない
ko: 블랙리스트에 등록된 사용자가 없습니다
zh: 暂无黑名单用户
zh_hant: 暫無黑名單用戶

# noGroupList
source: Group chats is empty
ar: لا توجد محادثات جماعية
ja: グループチャットなし
ko: 그룹 채팅 금지
zh: 暂无群聊
zh_hant: 暫無群聊

# noGroupApplicationList
source: No group application yet
ar: لا يوجد طلب جماعي حتى الآن
ja: グループ申請はまだありません
ko: 아직 단체 신청이 없습니다
zh: 暂无群申请
zh_hant: 暫無群申請

source: Group Chat Notifications
ar: إشعارات دردشة المجموعة
ja: グループチャット通知
ko: 그룹 채팅 알림
zh: 群聊通知
zh_hant: 群對話通知

source: invite
ar: دعوة
ja: 招待する
ko: 초대하다
zh: 邀请
zh_hant: 邀請

# groupApplicationAllReadyBeenProcessed
source: This invitation or request has been processed.
ar: تم معالجة هذا الطلب أو الدعوة بالفعل
ja: この招待または申請リクエストはすでに処理されています。
ko: 이 초대 또는 신청 요청은 이미 처리되었습니다.
zh: 此邀请或者申请请求已经被处理。
zh_hant: 此邀請或者申請請求已經被處理。

# accepted
source: Agreed
ar: تمت الموافقة
ja: 同意します
ko: 동의함
zh: 已同意
zh_hant: 已同意

# refused
source: Declined
ar: تم الرفض
ja: 拒否
ko: 거부됨
zh: 已拒绝
zh_hant: 已拒絕

source: Copy
ar: نسخ
ja: コピー
ko: 복사
zh: 复制
zh_hant: 复制

source: Recall
ar: استدعاء
ja: リコール
ko: 회수
zh: 撤回
zh_hant: 撤回

source: Forward
ar: إعادة توجيه
ja: 転送
ko: 전달
zh: 转发
zh_hant: 轉發
